[default]
defaultLNG=english
[english]
language info
{
lngName=english
lngRtl=0
}
GUI translation
{
fileMenu=&file
SelectLNG=select &language...
exit=e&xit
HelpMenu=&help
website=go to web site
About=&About
welcome1=welcome to the NB-Password generator.
welcome2=this tool can help you to create a Very strong passwords and it easy to use
welcome3=this tool was created by nacer baaziz
Options=options
capital=use &capital letterss
small=use &small letterss
nums=use &numbers
symbols=use s&ymbols
maxN=&max number
Generate=&Generate password
Pass=&password
regenerate=&regenerate password
copy=&copy password
SaveToF=save to &file
Main=&main
}
[arabic]
language info
{
lngName=arabic
lngRtl=1
}
GUI translation
{
fileMenu=&ملف
SelectLNG=إختر &لغة...
exit=ال&خروج
HelpMenu=م&ساعدة
website=الذهاب إلى موقع الأنترنت
About=&عن...
welcome1=مرحبا بكم في NB-Password generator.
welcome2=هذه الأداة يمكنها مساعدتك على إنشاء كلمات سر قوية جدا, وهي سهلة للاستخدام.
welcome3=هذه الأداة تم إنشائها بواسطة ناصر بعزيز
Options=خيارات
capital=استخدام الأحرف ال&كبيرة
small=استخدام الأحرف ال&صغيرة
nums=استخدام الأ&رقام
symbols=استخدام الر&موز
maxN=الرقم الأ&قصى
Generate=&توليد كلمة السر
Pass=&كلمة السر
regenerate=إ&عادة توليد كلمة السر
copy=&نسخ كلمة السر
SaveToF=ال&حفظ في ملف
Main=&الرئيسية
}
[french]
language info
{
lngName=french
lngRtl=0
}
GUI translation
{
fileMenu=&Fichier

SelectLNG=Sélectionner une &langue...
exit=&quitter
HelpMenu=&Aide
website=aller au site Web
About=&À propos...
welcome1=Bienvenue dans NB-Password generator.
welcome2=Cet outil peut vous aider à créer un mots de passe très forts, il est facile à utiliser
welcome3=Cet outil a été créé par nacer baaziz
Options=Options

capital=utiliser des lettres &majuscules
small=utiliser des lettres minu&scules
nums=utiliser des &nombres
symbols=utiliser des s&ymboles
maxN=&nombre &maximum
Generate=&générer
Pass=&mot de passe
regenerate=&regénérer le mot de passe
copy=&copier le mot de passe
SaveToF=enregistrer dans un &fichier
Main=&Accueil
}